{"_path":"/work/persuratan","_dir":"work","_draft":false,"_partial":false,"_locale":"id","title":"Layanan Persuratan","description":"Layanan permohonan persetujuan dokumen","url":"https://sms.ft.ugm.ac.id/persuratan","category":"Pekerjaan di FT-UGM","technologies":["CodeIgniter","Vue.js","ElementUI","PDF.js","Sass"],"thumbnail":"/img/works/persuratan/thumbnail.png","screenshots":[{"url":"/img/works/persuratan/1.login-page.png","alt":"Halaman Login"},{"url":"/img/works/persuratan/2.form-request.png","alt":"Membuat Permohonan"},{"url":"/img/works/persuratan/3.form-request-by-template.png","alt":"Membuat Permohonan dari Template"},{"url":"/img/works/persuratan/4.approval-detail-history.png","alt":"Detail Riwayat Approval"},{"url":"/img/works/persuratan/5.qr-code-management.png","alt":"Mengatur QR Code/Tanda Tangan"}],"content":"Secara sederhana, layanan ini hadir sebagai solusi dalam mempercepat proses permohonan persetujuan dokumen.\n\nSetiap dokumen biasanya memerlukan beberapa tahapan verifikasi sebelum dapat dianggap sah, yang mana memerlukan waktu yang cukup lama ketika melalui tiap tahapannya, belum lagi ketika dokumen yang diajukan ada kesalahan, maka perlu diperbaiki dan diajukan ulang dari awal. \n\nDengan layanan ini, masalah kecepatan waktu dapat diatasi karena dokumen diajukan dan diverifikasi secara online, bahkan ketika terdapat ketidaksesuaian pada dokumen yang diajukan, dapat direvisi dengan diajukan ulang dengan cepat.\n\nDengan tetap mengedepankan masalah legalitas dokumen, ketika dokumen sudah diterima maka akan diberikan penanda QR Code yang dapat dipindai untuk mengecek keaslian dokumen tersebut.\n\nTidak hanya itu, penggunaan QR Code juga dapat dibarengi dengan scan tanda tangan dari atasan yang melakukan verifikasi dan posisinya dapat diatur sesuai dengan keinginan. Dengan demikian dapat mencakup semua kebutuhan yang berbeda berdasarkan tujuan dokumen tersebut.","_id":"content:id:work:1.persuratan.yaml","_type":"yaml","_source":"content","_file":"id/work/1.persuratan.yaml","_extension":"yaml"}