{"_path":"/work/simadang","_dir":"work","_draft":false,"_partial":false,"_locale":"","title":"Sistem Administrasi Undangan","description":"Event invitations with food ordering system","url":"https://sms.ft.ugm.ac.id/undangan","category":"Work at FT-UGM","technologies":["CodeIgniter","Bootstrap","jQuery","Sass","Vue.js","Telegram Bot"],"thumbnail":"/img/works/simadang/thumbnail.png","screenshots":[{"url":"/img/works/simadang/1.login-page.png","alt":"Login Page"},{"url":"/img/works/simadang/2.invitation-type-options.png","alt":"Invitation Type Options"},{"url":"/img/works/simadang/3.invitation-form.png","alt":"Create Invitation"},{"url":"/img/works/simadang/4.invitation-result.png","alt":"Invitation Result"},{"url":"/img/works/simadang/5.food-ordering.png","alt":"Food Ordering"}],"content":"Sistem Administrasi Undangan (Simadang) is a service used to manage online invitations and everything related to the execution process in the form of sending invitations via email/telegram, confirming attendance, meeting notes, and ordering for consumption.\n\nThe main problem solved by this service is the problem of efficiency, both in terms of time, resources and financial efficiency. By sending invitations online, the time needed will be faster, it will be easier and faster for signatories to verify and confirm invitations before they are distributed, and invited guests can immediately confirm attendance which will also have an impact on the number of consumption orders, namely invited guests who confirm not attending will automatically reduce the number of consumption ordered.\n\nConsumption order is like an e-commerce which is done through the service and connected to the consumption provider partner. In this section, an invoice will be issued once a month to each partner from the many orders that have been placed. Thus, the expenditure of funds for stamps can be significantly reduced, which is compared to the conventional method that requires bills and stamps for each order.","_id":"content:work:2.simadang.yaml","_type":"yaml","_source":"content","_file":"work/2.simadang.yaml","_extension":"yaml"}