{"_path":"/work/simadang","_dir":"work","_draft":false,"_partial":false,"_locale":"id","title":"Sistem Administrasi Undangan","description":"Layanan undangan online dengan pemesanan konsumsi","url":"https://sms.ft.ugm.ac.id/undangan","category":"Pekerjaan di FT-UGM","technologies":["CodeIgniter","Bootstrap","jQuery","Sass","Vue.js","Telegram Bot"],"thumbnail":"/img/works/simadang/thumbnail.png","screenshots":[{"url":"/img/works/simadang/1.login-page.png","alt":"Halaman Login"},{"url":"/img/works/simadang/2.invitation-type-options.png","alt":"Pilihan Hasil Akhir Undangan"},{"url":"/img/works/simadang/3.invitation-form.png","alt":"Membuat Undangan"},{"url":"/img/works/simadang/4.invitation-result.png","alt":"Hasil Undangan"},{"url":"/img/works/simadang/5.food-ordering.png","alt":"Pemesanan Konsumsi"}],"content":"Simadang merupakan layanan yang digunakan untuk mengelola undangan secara online dan segala sesuatu yang berkaitan dengan proses pelaksanaannya berupa pengiriman undangan melalui email/telegram, konfirmasi kehadiran, notulensi, dan pemesanan konsumsi.\n\nMasalah utama yang diselesaikan dengan layanan ini adalah masalah efisiensi, baik dari sisi efisiensi waktu, sumber daya dan keuangan. Dengan dilakukannya pengiriman undangan secara online, maka waktu yang dibutuhkan akan lebih cepat, atasan penanda tangan menjadi lebih mudah dan cepat untuk memverifikasi dan mengkonfirmasi undangan sebelum disebarkan, dan tamu undangan bisa langsung melakukan konfirmasi kehadiran yang mana akan berdampak pula pada jumlah pemesanan konsumsi, yaitu tamu undangan yang mengkonfirmasi tidak hadir akan otomatis mengurangi jumlah konsumsi yang dipesan.\n\nPemesanan konsumsi layaknya sebuah e-commerce yang mana dilakukan melalui layanan dan terhubung ke mitra penyedia konsumsi. Pada bagian ini, tagihan akan diterbitkan satu kali dalam sebulan untuk tiap mitra dari banyak pesanan yang telah dilakukan. Sehingga, dengan demikian pengeluaran dana untuk materai dapat ditekan dengan signifikan, yaitu dibandingkan dengan cara konvensional yang memerlukan tagihan dan materai untuk tiap pemesanan.","_id":"content:id:work:2.simadang.yaml","_type":"yaml","_source":"content","_file":"id/work/2.simadang.yaml","_extension":"yaml"}