{"generatedAt":1678431670813,"generateTime":12,"contents":[{"_path":"/work/persuratan","_dir":"work","_draft":false,"_partial":false,"_locale":"","title":"Layanan Persuratan","description":"The online document approval request service","url":"https://sms.ft.ugm.ac.id/persuratan","category":"Work at FT-UGM","technologies":["CodeIgniter","Vue.js","ElementUI","PDF.js","Sass"],"thumbnail":"/img/works/persuratan/thumbnail.png","screenshots":["/img/works/persuratan/1.login-page.png","/img/works/persuratan/2.form-request.png","/img/works/persuratan/3.form-request-by-template.png","/img/works/persuratan/4.approval-detail-history.png","/img/works/persuratan/5.qr-code-management.png"],"content":"In easy terms, this service exists as a solution to speed up the document approval request process.\n\nEach document usually requires several levels of verification before it can be considered valid, which takes quite a long time when going through each level, especially when the submitted document has any mistakes, it needs to be corrected and resubmitted from the beginning. \n\nWith this service, the problem of time efficiency can be solved because documents are submitted and verified via online, and even when there are any discrepancies in the submitted documents, they can be revised and resubmitted quickly.\n\nBy keeping the legality of the document in mind, when the document has been accepted, it will be given a QR Code marker that can be scanned to check the legality of the document.\n\nFurthermore, the use of the QR Code can also be combined with a scanned signature from the supervisor who is doing the verification and the position can be adjusted as desired. Thus it can cover all the different requirements based on the purpose of the document.","_id":"content:work:1.persuratan.yaml","_type":"yaml","_source":"content","_file":"work/1.persuratan.yaml","_extension":"yaml"},{"_path":"/work/simadang","_dir":"work","_draft":false,"_partial":false,"_locale":"","title":"Sistem Administrasi Undangan","description":"Event invitations with food ordering system","url":"https://sms.ft.ugm.ac.id/undangan","category":"Work at FT-UGM","technologies":["CodeIgniter","Bootstrap","jQuery","Sass","Vue.js","Telegram Bot"],"thumbnail":"/img/works/simadang/thumbnail.png","screenshots":["/img/works/simadang/1.login-page.png","/img/works/simadang/2.invitation-type-options.png","/img/works/simadang/3.invitation-form.png","/img/works/simadang/4.invitation-result.png","/img/works/simadang/5.food-ordering.png"],"content":"Sistem Administrasi Undangan (Simadang) is a service used to manage online invitations and everything related to the execution process in the form of sending invitations via email/telegram, confirming attendance, meeting notes, and ordering for consumption.\n\nThe main problem solved by this service is the problem of efficiency, both in terms of time, resources and financial efficiency. By sending invitations online, the time needed will be faster, it will be easier and faster for signatories to verify and confirm invitations before they are distributed, and invited guests can immediately confirm attendance which will also have an impact on the number of consumption orders, namely invited guests who confirm not attending will automatically reduce the number of consumption ordered.\n\nConsumption order is like an e-commerce which is done through the service and connected to the consumption provider partner. In this section, an invoice will be issued once a month to each partner from the many orders that have been placed. Thus, the expenditure of funds for stamps can be significantly reduced, which is compared to the conventional method that requires bills and stamps for each order.","_id":"content:work:2.simadang.yaml","_type":"yaml","_source":"content","_file":"work/2.simadang.yaml","_extension":"yaml"},{"_path":"/work/belanja","_dir":"work","_draft":false,"_partial":false,"_locale":"","title":"Layanan Belanja","description":"An internal e-commerce for ordering office stationery and housekeeping","url":"https://sms.ft.ugm.ac.id/belanja","category":"Work at FT-UGM","technologies":["CodeIgniter","Vue.js","Sass"],"thumbnail":"/img/works/belanja/thumbnail.png","screenshots":["/img/works/belanja/1.login-page.png","/img/works/belanja/2.shopping.png","/img/works/belanja/3.checkout.png"],"content":"Office stationery and housekeeping is a definite need by all departments in the Faculty of Engineering UGM, and it becomes a problem when the cost for operations (e.g. stamps) reaches a high number compared to the goods purchased, because stamps are needed for every purchase bill made.\n\nSo this service becomes an internal e-commerce to meet the needs of office stationery and housekeeping of all existing departments. That is by cooperating with a partner provider, where the payment is made once a month. Thus the expenditure of funds for the purchase of stamps can be saved.","_id":"content:work:3.belanja.yaml","_type":"yaml","_source":"content","_file":"work/3.belanja.yaml","_extension":"yaml"},{"_path":"/work/ulem","_dir":"work","_draft":false,"_partial":false,"_locale":"","title":"Layanan Uang Lembur","description":"The overtime management service","url":"https://sms.ft.ugm.ac.id/ulem","category":"Work at FT-UGM","technologies":["CodeIgniter","Bootstrap","jQuery","Sass"],"thumbnail":"/img/works/ulem/thumbnail.png","screenshots":["/img/works/ulem/1.login-page.png","/img/works/ulem/2.form-request.png","/img/works/ulem/3.my-assignment-letter.png","/img/works/ulem/4.payment-report-summary.png"],"content":"Layanan Uang Lembur (Ulem) is a service to manage the overtime activities up to the payment stage. \n\nEvery employee who works overtime requires approval from the supervisor before starting, which means that overtime activities can be carried out as needed. The implementation also becomes more controllable because it can be monitored through the service, and can meet the applicable rules. For example, it is determined that the maximum overtime in 1 week is 12 hours, so that when applying from the service there will be a validation process first, this is so that in the payment phase the employee concerned is not disadvantaged if he exceeds the time limit.\n\nFrom the supervisor's side, it can also be easier to know the total expenditure of overtime and who is working overtime, which can help in making further decisions, for example related to the intensity of work and the quality of employee work.","_id":"content:work:4.ulem.yaml","_type":"yaml","_source":"content","_file":"work/4.ulem.yaml","_extension":"yaml"},{"_path":"/work/quran-id","_dir":"work","_draft":false,"_partial":false,"_locale":"","title":"Quran ID","description":"Completely free Quran app with Indonesian translation and more","url":"https://ngekoding.github.io/quran-id","category":"Personal Project","technologies":["Vue.js","Quasar Framework","Howler.js","Swiper.js"],"thumbnail":"/img/works/quran-id/thumbnail.png","screenshots":["/img/works/quran-id/1.surah-list-verse-pieces-search.png","/img/works/quran-id/2.reading-mode-tajweed.png","/img/works/quran-id/3.settings.png"],"content":"Quran ID is a Quran application that comes with Indonesian translation. It is also equipped with a search feature based on chunks of verses, coloring of the Tajweed rules and audio recitation that can be played in various modes. In addition, verses and translations can be copied for any purpose. \n\nThis application was inspired by the number of Quran applications in the market that display inappropriate advertisements, so the idea came to create a Quran application that is completely free without any advertisements at all. Thus, it is hoped that we can still be solemn when reading the Quran.","_id":"content:work:5.quran-id.yaml","_type":"yaml","_source":"content","_file":"work/5.quran-id.yaml","_extension":"yaml"},{"_path":"/work/radio-dakwah","_dir":"work","_draft":false,"_partial":false,"_locale":"","title":"Radio Dakwah","description":"Keep peaceful heart by listening safe online radio","url":"https://ngekoding.github.io/radio-dakwah","category":"Personal Project","technologies":["Vue.js","Howler.js","Sass"],"thumbnail":"/img/works/radio-dakwah/thumbnail.png","screenshots":["/img/works/radio-dakwah/screenshot.png"],"content":"Radio Dakwah is an online radio that focuses on da'wah radio stations and can be accessed easily through the user's browser. This way, a peaceful heart can be more easily obtained.","_id":"content:work:6.radio-dakwah.yaml","_type":"yaml","_source":"content","_file":"work/6.radio-dakwah.yaml","_extension":"yaml"},{"_path":"/work/berbagi-catatan","_dir":"work","_draft":false,"_partial":false,"_locale":"","title":"Berbagi Catatan","description":"Convert text notes to image for easy sharing","url":"https://ngekoding.github.io/notes-to-image","category":"Personal Project","technologies":["Progressive Web App","Vue.js","Tiptap","Sass"],"thumbnail":"/img/works/berbagi-catatan/thumbnail.png","screenshots":["/img/works/berbagi-catatan/screenshot.png"],"content":"Berbagi Catatan is a tool to convert text notes into beautiful images. Users can then download and share them easily.\n\nThe original idea of this app was for sharing islamic lecture notes, which has been enhanced with better support for Arabic writing and several other writing styles for easy reading. In addition, the resulting images can be organized into multiple images, so that long text notes can still be presented well and easy to read.","_id":"content:work:7.berbagi-catatan.yaml","_type":"yaml","_source":"content","_file":"work/7.berbagi-catatan.yaml","_extension":"yaml"}],"navigation":[{"title":"Work","_path":"/work","children":[{"title":"Layanan Persuratan","_path":"/work/persuratan"},{"title":"Sistem Administrasi Undangan","_path":"/work/simadang"},{"title":"Layanan Belanja","_path":"/work/belanja"},{"title":"Layanan Uang Lembur","_path":"/work/ulem"},{"title":"Quran ID","_path":"/work/quran-id"},{"title":"Radio Dakwah","_path":"/work/radio-dakwah"},{"title":"Berbagi Catatan","_path":"/work/berbagi-catatan"}]}]}